12/data/attachments/2e621a4ad287a1bd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2285751f-b641-4364-b570-3a4ef0958e6f</nif:username>
            <nif:friendToBeAdded>Patrick_can_Friend_60417_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>